IdeaRS.Connections
StiffenerData Properties
Compatible with IDEA StatiCa 0.0
The StiffenerData type exposes the following members.
Properties
Name | Description
CapPlateOffset
Delta
 Gets or sets the distance between repeated stiffeners
Gap
 Gets or sets the gap between the outline of the stiffener and particular plates of the beam
ChamferCorners
 If true corners are chamfered
ChamferSize
 Gets or sets the size of the chamfer
IsActive |  (Inherited from ConnectionCmdData.)
IsCapPlate
Location
 Gets or sets the location of the stiffener
MemberPath
 Gets or sets the member to which the stiffener is connected
Name
 Gets or set the name
 (Inherited from ConnectionCmdData.)
NumberOfStiffeners
 Gets or sets the number of stiffeners (the property Delta represents the distance between repeating stiffeners)
OffsetBottom
 Gets or sets the offset of stiffener on the bottom edge.
OffsetTop
 Gets or sets the offset of stiffener on the top edge.
OperationId
 Gets or sets the identifier of the operation in the manufacturer sequence
 (Inherited from ConnectionCmdData.)
PlateMaterialName
 Gets or sets the name of the material If value is null or empty material is taken from column
 (Inherited from PlateDataBase.)
PosOnMember
 Gets or sets the position of the stiffener on the member
ReferenceBoundingBoxSide
 Gets or sets the sides on bounding box of the reference member. Stiffeners will be placed according to these planes
ReferenceMemberPath
 Gets or sets the reference member (stiffeners will be placed according to this member)
RemainingPart
Rotation
 Gets or sets the rotation of the stiffener
ShapeData
 Collection of plate editor data
 (Inherited from PlateDataBase.)
StiffenerWidth
 Gets or sets the width of the stiffener
Thickness
 Gets or sets the thickness of the plate
 (Inherited from PlateDataBase.)
TubeCircStiffDiam
 The diameter of the circular stiffener (tubes)
TubeRectStiffHeight
 The height of the rectangular stiffener (tubes)
TubeRectStiffRotation
 The rotation of the rectangular stiffener (tubes)
TubeRectStiffWidth
 The width of the rectangular stiffener (tubes)
TubeStiffShape
 Shape of the stiffener on tubes
Weld
 Gets or sets the properties of the weld
Top
See Also
Reference
StiffenerData Class
IdeaRS.Connections.Data Namespace